Ran Plan for 2 projects:

1. dir: `.` workspace: `default`
1. dir: `tools` workspace: `default`
---

### 1. dir: `.` workspace: `default`
```diff
No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://8747adfea2ee:4141/lock?id=baobao-ck%252Ftest-atlantis%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```

---
### 2. dir: `tools` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/atlantis/repos/baobao-ck/test-atlantis/2/default/tools/default.tfplan"' in '/atlantis/repos/baobao-ck/test-atlantis/2/default/tools': exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"          = "Test-d"
          + "ProvisionedBy" = "Atlantis"
        }
      + tags_all                    = {
          + "Name"          = "Test-d"
          + "ProvisionedBy" = "Atlantis"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # random_id.bucket_suffix will be created
  + resource "random_id" "bucket_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Error: all attributes must be indexed. Unused attributes: ["Id"]
│ read_capacity must be at least 1 when billing_mode is "PROVISIONED"
│ write_capacity must be at least 1 when billing_mode is "PROVISIONED"
│ 
│   with aws_dynamodb_table.dynamodb_table,
│   on main.tf line 14, in resource "aws_dynamodb_table" "dynamodb_table":
│   14: resource "aws_dynamodb_table" "dynamodb_table" {
│ 
╵


```
</details>

---
### Plan Summary

2 projects, 0 with changes, 1 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```